name: "model_test",
platform: "onnxruntime_onnx",
backend: "onnxruntime",
max_batch_size: 4,
input: [
  {
    name: "images",
    data_type: TYPE_FP32,
    format: FORMAT_NONE,
    dims: [
      3,
      -1,
      -1
    ],
  }
]
output: [
  {
    name: "output",
    data_type: TYPE_FP32,
    dims: [
      10
    ],
    label_filename: "cifar10_labels.txt",
  }
]
