# Copyright (C) 2025 YIQISOFT
#
# SPDX-License-Identifier: Apache-2.0
#

backend: "onnxruntime"
# max_batch_size: 8 # Set based on your GPU capacity

input [
  {
    name: "images" # IMPORTANT: This name must match the input name in your ONNX model
    data_type: TYPE_FP32
    dims: [ 1, 3, 640, 640 ] # Format is [C, H, W]
  }
]

output [
  {
    name: "output0" # IMPORTANT: This name must match the output name in your ONNX model
    data_type: TYPE_FP32
    #dims: [ 1, 84, 8400 ]
    dims: [ -1, 84, -1 ] # Example dimensions. YOLOv8/v5 is typically [batch, 4+1+num_classes, num_proposals]
                      # e.g., [1, 84, 8400] -> 84 = 4 (xywh) + 80 (classes)
  }
]
