name: "detection"
platform: "onnxruntime_onnx"
max_batch_size : 32
input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
  }
]

output: [
    {
        name: "output0"
        data_type: TYPE_FP32
        dims: [ -1, -1 ]
    }
]

optimization { execution_accelerators {
  gpu_execution_accelerator : [ {
    name : "tensorrt"
    parameters { key: "precision_mode" value: "FP16" }
    parameters { key: "trt_engine_cache_enable" value: "1" }}]
}}
