name: "tracking"
backend: "python"
max_batch_size: 32

sequence_batching {
  max_sequence_idle_microseconds: 5000000
  oldest
    {
      max_candidate_sequences: 4
      preferred_batch_size: [ 32 ]
    }
  control_input [
    {
      name: "START"
      control [
        {
          kind: CONTROL_SEQUENCE_START
          fp32_false_true: [ 0, 1 ]
        }
      ]
    },
    {
      name: "END"
      control [
        {
          kind: CONTROL_SEQUENCE_END
          fp32_false_true: [ 0, 1 ]
        }
      ]
    },
    {
      name: "CORRID"
      control [
        {
          kind: CONTROL_SEQUENCE_CORRID
          data_type: TYPE_UINT64
        }
      ]
    }
  ]
}

input [
{
    name: "detections"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
},
{
    name: "frame"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
}
]

output [
{
    name: "tracks"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
}
]

instance_group [{ kind: KIND_CPU }]
