name: "detection_preprocessing"
backend: "python"
max_batch_size: 32
input [
{
    name: "image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
}
]

output [
{
    name: "preprocessed_image"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
},
{
    name: "preprocessing_params"
    data_type: TYPE_FP32
    dims: [ -1 ]
}
]

instance_group [{ kind: KIND_CPU }]
