name: "ensemble"
platform: "ensemble"
max_batch_size: 0

input [
    {
        name: "image"
        data_type: TYPE_UINT8
        dims: [ -1, -1, 3 ]
    }
]

output [
    {
        name: "bboxes"
        data_type: TYPE_FP32
        dims: [ -1, 4 ]
    },
    {
        name: "scores"
        data_type: TYPE_FP32
        dims: [ -1 ]
    },
    {
        name: "ids"
        data_type: TYPE_UINT32
        dims: [ -1 ]
    }
]

ensemble_scheduling {
  step [
    {
        model_name: "detection_preprocessing"
        model_version: -1
        input_map {
            key: "detection_preprocessing_input"
            value: "image"
        }
        output_map {
            key: "detection_preprocessing_output"
            value: "preprocessed_image"
        }
        output_map {
            key: "detection_preprocessing_shape"
            value: "shape"
        }
    },
    {
        model_name: "yolov8n"
        model_version: -1
        input_map {
            key: "images"
            value: "preprocessed_image"
        }
        output_map {
            key: "output0"
            value: "detections"
        }
    },
    {
        model_name: "detection_postprocessing_cuda"
        model_version: -1
        input_map {
            key: "detection_postprocessing_detections"
            value: "detections"
        }
        input_map {
            key: "detection_postprocessing_shape"
            value: "shape"
        }
        output_map {
            key: "detection_postprocessing_bboxes"
            value: "bboxes"
        }
        output_map {
            key: "detection_postprocessing_scores"
            value: "scores"
        }
        output_map {
            key: "detection_postprocessing_ids"
            value: "ids"
        }
    }
  ]
}
