platform: "onnxruntime_onnx"
max_batch_size: 0
input [
{
  name: "images"
  data_type: TYPE_FP32
  dims: [ 1, 3,640,640 ]
}
]
output [
{
  name: "output0"
  data_type: TYPE_FP32
  dims: 1
  dims: 116
  dims: 8400
},
{
  name: "output1"
  data_type: TYPE_FP32
  dims: 1
  dims: 32
  dims: 160
  dims: 160
}
]