# Copyright (C) 2025 YIQISOFT
#
# SPDX-License-Identifier: Apache-2.0
#

platform: "ensemble"
# max_batch_size: 8

# Input visible to the client
input [
  {
    name: "image_input" # The input name the client must provide
    data_type: TYPE_FP32
    dims: [1, 3, 640, 640 ]
  }
]

# Output visible to the client
output [
  {
    name: "final_boxes" # The final output name the client receives
    data_type: TYPE_FP32
    dims: [1, -1, 7 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "yolov8n_onnx"
      model_version: -1
      # Map the ensemble input "image_input" to the ONNX model input "images"
      input_map {
        key: "images"
        value: "image_input"
      }
      # Map the ONNX model output "output0" to an intermediate variable "onnx_output"
      output_map {
        key: "output0"
        value: "onnx_output"
      }
    },
    {
      model_name: "yolov8n_postprocess"
      model_version: -1
      # Map the intermediate variable "onnx_output" to the post-processing model input "raw_output"
      input_map {
        key: "raw_output"
        value: "onnx_output"
      }
      # Map the post-processing model output "bboxes" to the ensemble's final output "final_boxes"
      output_map {
        key: "bboxes"
        value: "final_boxes"
      }
    }
  ]
}